/*********************************************************************************************************
* 文件名称: TPS22993.h
* 文件作者:相信未来
* 当前版本: 01.00.00
* 所属模块: CMS
* 创建日期: 2016年03月22日
* 文件摘要: 
* 注意事项: 
* 更改说明: 初始创建
**********************************************************************************************************/
#ifndef __TPS22993_H
#define __TPS22993_H



/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "stm32f10x.h"


/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define  TPS22993_DEVEICE0_ADD		0x72			//PCA9557设备1地址
#define  TPS22993_DEVEICE1_ADD		0x74



#define  TPS22993_SWITCH_ON				0x01
#define  TPS22993_SWITCH_OFF			0x00




/*********************************************************************************************************
*                                              结构体定义
*********************************************************************************************************/
typedef enum 
{
	TPS22993_DEV1_ALL_OFF = 0,
	TPS22993_DEV1_TP_AVDD,
	TPS22993_DEV1_TP_DVDD,
	TPS22993_DEV1_LCD_AVDD,
	TPS22993_DEV1_EXT_POWER,
	TPS22993_DEV1_ALL_ON,	
}TPS22993_DEV1_TypeDef;




typedef enum 
{
	TPS22993_DEV0_ALL_OFF = 0,
	TPS22993_DEV0_VSP_VSN,
	TPS22993_DEV0_LCD_DVDD,
	TPS22993_DEV0_ALL_ON,
}TPS22993_DEV0_TypeDef;


typedef enum 
{
	ONDELAY11US = 0,						//默认
	ONDELAY105US,
	ONDELAY330US,
	ONDELAY950US,
}TPS22993_ONDELAY_TypeDef;				//上电延迟




typedef enum 
{
	SLEWRATE1USV = 0,
	SLEWRATE150USV,
	SLEWRATE250USV,
	SLEWRATE460USV,							//默认
	SLEWRATE890USV,
}TPS22993_SLEWRATE_TypeDef;				//斜率


typedef enum 
{
	QOD110R = 0,
	QOD490R,
	QOD951R,								//默认
	QODNONE,								//高阻态
}TPS22993_QOD_TypeDef;					//放电电阻


typedef enum 
{
	TPS22993_CHN1 = 0,
	TPS22993_CHN2,	
	TPS22993_CHN3,	
	TPS22993_CHN4,
	//TPS22993_CHN_ALL,	
}TPS22993_CHN_TypeDef;



/*********************************************************************************************************
*                                              API函数定义
*********************************************************************************************************/
void TPS22993_Init(void);
void TPS22993_Set_Mode(TPS22993_CHN_TypeDef chn,u8 mode);
void TPS22993_Sel_Dev(u8 val);
void TPS22993_On(TPS22993_CHN_TypeDef chn);
void TPS22993_Off(TPS22993_CHN_TypeDef chn);
void TPS22993_Set_All_Mode(u8 val);



















#endif


